
  ## Terraforming *Staging*
  <details>
    <summary>
      Show Plan
    </summary>
    ```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_region.current: Refreshing state...
data.cloudfoundry_space.space: Refreshing state...
module.queue.cloudfoundry_user_provided_service.queue-credentials: Refreshing state... [id=1bd1626a-7a50-4de9-86c0-efba8e31bf1e]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.queue.data.aws_iam_policy_document.queue-policy-document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue-policy-document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.queue.aws_iam_access_key.queue-user-access-key will be created
  + resource "aws_iam_access_key" "queue-user-access-key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "federalist-staging-sqs"
    }

  # module.queue.aws_iam_policy.queue-policy will be created
  + resource "aws_iam_policy" "queue-policy" {
      + arn         = (known after apply)
      + description = "SQS Queue Policy"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.queue.aws_iam_user.queue-user will be created
  + resource "aws_iam_user" "queue-user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "federalist-staging-sqs"
      + path          = "/"
      + tags          = {
          + "Environment" = "staging"
        }
      + unique_id     = (known after apply)
    }

  # module.queue.aws_iam_user_policy_attachment.queue-user-policy-attach will be created
  + resource "aws_iam_user_policy_attachment" "queue-user-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "federalist-staging-sqs"
    }

  # module.queue.aws_sqs_queue.queue will be created
  + resource "aws_sqs_queue" "queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Environment" = "staging"
        }
      + visibility_timeout_seconds        = 30
    }

  # module.queue.cloudfoundry_user_provided_service.queue-credentials will be updated in-place
  ~ resource "cloudfoundry_user_provided_service" "queue-credentials" {
      ~ credentials = (sensitive value)
        id          = "1bd1626a-7a50-4de9-86c0-efba8e31bf1e"
        name        = "federalist-staging-sqs-creds"
        space       = "af7be42d-47d6-4b4d-a15a-7098c7695c43"
        tags        = []
    }

Plan: 5 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```
  </details>
